[
    {
        "id": 5686,
        "name": "Cơm trộn Hàn Quốc",
        "price": 450000,
        "type": "Mặn",
        "description": "Cơm trộn Hàn Quốc, hay còn gọi là Bibimbap, là một món ăn truyền thống mang hương vị độc đáo và hấp dẫn. Từng lớp cơm trắng dẻo thơm được kết hợp hoàn hảo với nhiều loại rau tươi xanh mát như cải bó xôi, cà rốt, nấm, và bắp cải, cùng với thịt bò xào hoặc đậu hũ. Món ăn được hoàn thiện bằng một quả trứng lòng đào vàng ươm, kèm theo sốt Gochujang cay ngọt, tạo nên sự hòa quyện tuyệt vời giữa các hương vị. Cơm trộn không chỉ ngon miệng mà còn rất bổ dưỡng, giúp bạn trải nghiệm văn hóa ẩm thực Hàn Quốc một cách trọn vẹn.",
        "image_link": "https://images.pexels.com/photos/26390889/pexels-photo-26390889/free-photo-of-b-a-tr-a-b-a-an-tr-ng-th-t.jpeg?auto=compress&cs=tinysrgb&w=600"
    },
    {
        "id": 3021,
        "name": "Hamburger",
        "price": 350000,
        "type": "Mặn",
        "description": "Hamburger là một món ăn nổi tiếng và được yêu thích trên toàn thế giới, đặc biệt là ở Mỹ. Với lớp thịt bò tươi ngon, nướng trên lửa than cho đến khi chín tới, giữ nguyên vị ngọt và độ ẩm, được kẹp giữa hai bánh mì mềm mịn. Món ăn này thường được hoàn thiện bằng phô mai tan chảy, rau xà lách giòn, cà chua chín mọng và dưa chuột muối, tạo nên một hương vị tuyệt vời. Một chút sốt mayonnaise hoặc sốt BBQ cũng sẽ làm tăng thêm sự hấp dẫn cho từng miếng bánh. Hamburger không chỉ ngon mà còn dễ dàng tùy chỉnh theo sở thích của bạn.",
        "image_link": "https://img.freepik.com/premium-photo/tasty-burger-with-cheese-salad-dark-background_995105-673.jpg"
    },
    {
        "id": 8208,
        "name": "Bánh mì",
        "price": 150000,
        "type": "Tăng cân",
        "description": "Bánh mì là món ăn đường phố nổi tiếng của Việt Nam, nổi bật với lớp vỏ giòn rụm bên ngoài và nhân phong phú bên trong. Được làm từ bột mì tươi ngon, bánh mì có thể được kẹp với nhiều loại nhân đa dạng như thịt heo xá xíu, thịt bò nướng, hoặc đậu hũ, kết hợp cùng với các loại rau sống tươi mát như dưa leo, rau mùi, và ớt để tạo sự cân bằng vị giác. Món ăn này thường được hoàn thiện với nước sốt đặc trưng, mang đến hương vị thơm ngon và hấp dẫn. Bánh mì không chỉ là một món ăn tiện lợi mà còn là biểu tượng của văn hóa ẩm thực Việt Nam.",
        "image_link": "https://images.pexels.com/photos/1630309/pexels-photo-1630309.jpeg?auto=compress&cs=tinysrgb&w=600"
    },
    {
        "id": 7682,
        "name": "Spaghetti",
        "price": 220000,
        "type": "Chay",
        "description": "Spaghetti là món mì Ý nổi tiếng, mang đến trải nghiệm ẩm thực tuyệt vời với từng sợi mì dài, mềm mượt được nấu chín hoàn hảo. Món ăn này thường được kết hợp với sốt cà chua tươi ngon, thảo mộc và gia vị thơm lừng, tạo nên hương vị đậm đà. Bạn có thể thêm các loại rau củ tươi ngon như nấm, ớt chuông, và hành tây, hoặc tùy chỉnh với phô mai Parmesan rắc lên trên để tăng thêm phần hấp dẫn. Spaghetti không chỉ là một món ăn ngon mà còn mang đậm phong cách ẩm thực Ý, hoàn hảo cho những ai yêu thích sự nhẹ nhàng và thanh đạm.",
        "image_link": "https://nhatkycuacoay.com/wp-content/uploads/2022/05/Huong-dan-cach-lam-mi-y-spaghetti-scaled.jpeg"
    },    
    {
        "id": 3931,
        "name": "Phở",
        "price": 180000,
        "type": "Giảm cân",
        "description": "Phở, món ăn biểu tượng của ẩm thực Việt Nam, mang đến sự kết hợp tuyệt vời giữa bánh phở mềm mượt và nước dùng thanh nhẹ, được ninh từ xương trong nhiều giờ. Món ăn thường được phục vụ với thịt bò tái hoặc gà xé, tạo nên hương vị đậm đà và giàu dinh dưỡng. Sự hòa quyện của các gia vị như quế, hồi và thảo quả mang lại trải nghiệm thơm ngon khó quên. Đặc biệt, bạn có thể tự do tùy chỉnh hương vị bằng cách thêm rau thơm tươi ngon như hành lá, rau mùi, và giá đỗ, cùng với một chút chanh và ớt để tăng thêm phần tươi mát và cay nồng. Phở không chỉ là một bữa ăn ngon miệng mà còn rất phù hợp cho những ai đang tìm kiếm một lựa chọn giảm cân hiệu quả.",
        "image_link": "https://images.pexels.com/photos/16547243/pexels-photo-16547243/free-photo-of-mon-an-ga-ch-p-nh-th-c-ph-m-mon-an-vi-t-nam.jpeg?auto=compress&cs=tinysrgb&w=600"
    },    
    {
        "id": 5394,
        "name": "Kimbap",
        "price": 180000,
        "type": "Giảm cân",
        "description": "Kimbap là một món ăn truyền thống Hàn Quốc, nổi bật với những cuộn cơm được chế biến từ gạo trắng dẻo thơm, cuộn cùng với rau củ tươi sống như dưa leo, cà rốt, và cải bó xôi, cùng với trứng chiên và thịt bò hoặc đậu hũ. Món ăn này không chỉ thơm ngon mà còn rất bổ dưỡng, phù hợp cho những ai đang tìm kiếm một lựa chọn nhẹ nhàng và lành mạnh để giảm cân. Kimbap thường được cắt thành từng miếng nhỏ dễ ăn, hoàn hảo cho bữa trưa hoặc bữa ăn nhẹ. Mỗi miếng Kimbap đều mang đến sự hòa quyện hoàn hảo giữa vị ngọt của rau và vị mặn của gia vị, tạo nên trải nghiệm ẩm thực thú vị.",
        "image_link": "https://images.pexels.com/photos/23645826/pexels-photo-23645826/free-photo-of-mon-an-dia-nha-hang-ca.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1"
    },    
    {
        "id": 6545,
        "name": "Mì lạnh",
        "price": 150000,
        "type": "Chay",
        "description": "Mì lạnh là một món ăn truyền thống được yêu thích, đặc biệt trong những ngày hè oi ả. Món ăn này thường được làm từ mì sợi mỏng, được trụng qua nước sôi rồi làm lạnh, tạo cảm giác mát lạnh sảng khoái. Mì lạnh thường được phục vụ kèm với nước sốt chua ngọt, rau sống tươi mát như dưa leo, rau mùi và ớt, tạo nên sự hòa quyện hoàn hảo giữa vị chua, ngọt và cay. Đây là một lựa chọn lý tưởng cho những ai yêu thích sự nhẹ nhàng và lành mạnh trong bữa ăn, giúp bạn cảm thấy sảng khoái và tràn đầy năng lượng.",
        "image_link": "https://images.pexels.com/photos/2098135/pexels-photo-2098135.jpeg?auto=compress&cs=tinysrgb&w=600"
    },    
    {
        "id": 9833,
        "name": "Cá nướng",
        "price": 220000,
        "type": "Mặn",
        "description": "Cá nướng là một món ăn ngon miệng, mang đến hương vị đậm đà từ những miếng cá tươi ngon được tẩm ướp gia vị và nướng trên than hồng. Món ăn không chỉ có lớp da ngoài giòn rụm mà còn giữ nguyên độ ẩm và vị ngọt tự nhiên của cá. Thường được phục vụ kèm với các loại rau củ tươi như rau xà lách, dưa leo và chanh, cá nướng không chỉ là một bữa ăn hấp dẫn mà còn rất bổ dưỡng. Đây là món ăn lý tưởng cho những buổi tiệc ngoài trời hoặc bữa cơm gia đình, mang lại trải nghiệm ẩm thực trọn vẹn và ấm cúng.",
        "image_link": "https://images.pexels.com/photos/262959/pexels-photo-262959.jpeg?auto=compress&cs=tinysrgb&w=600"
    },    
    {
        "id": 4363,
        "name": "Steak",
        "price": 350000,
        "type": "Mặn",
        "description": "Steak là một món ăn nổi tiếng, thường được làm từ thịt bò chất lượng cao, được nướng hoặc chiên chín tới để giữ nguyên vị ngọt và độ mềm của thịt. Món ăn này thường được phục vụ kèm với các loại gia vị như muối, tiêu, và bơ, tạo nên hương vị đậm đà. Để tăng thêm phần hấp dẫn, steak có thể được đi kèm với rau củ nướng hoặc khoai tây nghiền. Đây là lựa chọn hoàn hảo cho những ai yêu thích ẩm thực phương Tây, mang đến trải nghiệm thưởng thức tuyệt vời trong mỗi miếng thịt.",
        "image_link": "https://images.pexels.com/photos/769289/pexels-photo-769289.jpeg?auto=compress&cs=tinysrgb&w=600"
    },    
    {
        "id": 7113,
        "name": "Cơm rang",
        "price": 220000,
        "type": "Tăng cân",
        "description": "Cơm rang là món ăn phổ biến và hấp dẫn, được chế biến từ cơm nguội, rang vàng với các loại gia vị và nguyên liệu tươi ngon như thịt gà, tôm, hoặc xúc xích, cùng với rau củ màu sắc như đậu hà lan, cà rốt. Món ăn này không chỉ thơm ngon mà còn rất bổ dưỡng, phù hợp cho những ai muốn tăng cân. Cơm rang thường được trang trí với hành lá tươi và một chút tiêu xay, tạo nên sự hòa quyện giữa vị mặn, ngọt và cay, mang lại trải nghiệm ẩm thực thú vị. Đây là lựa chọn tuyệt vời cho bữa trưa hoặc bữa tối, dễ dàng làm và ngon miệng.",
        "image_link": "https://i1-giadinh.vnecdn.net/2023/10/17/Bc8Thnhphm18-1697527744-8879-1697527935.jpg?w=500&h=500&q=100&dpr=2&fit=crop&s=9zeDnegs6WifmFPK1zopmA"
    },    
    {
        "id": 3723,
        "name": "Lẩu cá",
        "price": 450000,
        "type": "Mặn",
        "description": "Lẩu cá là một món ăn tuyệt vời, lý tưởng cho những buổi tụ tập gia đình hoặc bạn bè. Món ăn này được chế biến từ cá tươi ngon, nấu trong nồi nước dùng đậm đà, thường kết hợp với các loại gia vị như gừng, hành, và ớt để tạo nên hương vị phong phú. Khi thưởng thức, bạn có thể thêm rau sống, nấm, và bún hoặc mì, tạo nên sự hòa quyện hoàn hảo giữa các thành phần. Món lẩu cá không chỉ mang lại trải nghiệm ẩm thực thú vị mà còn là một bữa ăn đầy dinh dưỡng và ấm cúng, rất thích hợp cho mùa đông.",
        "image_link": "https://i1-giadinh.vnecdn.net/2023/02/03/Bc5thnhphm1-1675416493-5672-1675416498.jpg?w=500&h=500&q=100&dpr=2&fit=crop&s=UXbfTRQkjh-lcXyHvToo2A"
    },    
    {
        "id": 5698,
        "name": "Trứng gà nướng",
        "price": 180000,
        "type": "Giảm cân",
        "description": "Trứng gà nướng là món ăn đơn giản nhưng đầy hấp dẫn, lý tưởng cho những ai đang tìm kiếm một bữa ăn nhẹ và lành mạnh. Trứng được nướng chín tới, giữ nguyên độ mềm mịn và hương vị tự nhiên, thường được tẩm ướp với các loại gia vị như muối, tiêu, và một chút hành lá để tăng thêm hương vị. Món ăn này không chỉ dễ làm mà còn rất bổ dưỡng, cung cấp protein và các vitamin cần thiết cho cơ thể. Trứng gà nướng có thể được phục vụ kèm với salad rau tươi mát, tạo nên một bữa ăn hoàn hảo cho việc giảm cân mà vẫn đảm bảo sự ngon miệng.",
        "image_link": "https://i1-giadinh.vnecdn.net/2023/11/04/Bc6Thnhphm16-1699072213-8990-1699072343.jpg?w=500&h=500&q=100&dpr=2&fit=crop&s=Cz22ArE2ESW7TETJI38EZw"
    },    
    {
        "id": 9471,
        "name": "Khoai tây chiên",
        "price": 200000,
        "type": "Tăng cân",
        "description": "Khoai tây chiên là món ăn vặt phổ biến, được chế biến từ những củ khoai tây tươi ngon, cắt thành từng miếng hoặc que, sau đó chiên vàng giòn trong dầu nóng. Món ăn này có vị giòn tan bên ngoài, mềm mại bên trong, thường được phục vụ kèm với muối hoặc sốt mayonnaise, tương cà để tăng thêm hương vị. Khoai tây chiên không chỉ là món ăn lý tưởng cho những ai muốn tăng cân mà còn là lựa chọn hoàn hảo cho những buổi tiệc tùng hoặc khi xem phim. Với mỗi miếng khoai tây chiên, bạn sẽ cảm nhận được sự hòa quyện tuyệt vời giữa độ giòn và hương vị thơm ngon.",
        "image_link": "https://cdn.pixabay.com/photo/2016/11/21/15/52/french-fries-1846083_1280.jpg"
    },    
    {
        "id": 4180,
        "name": "Cá hồi hải sản",
        "price": 500000,
        "type": "Mặn",
        "description": "Cá hồi hải sản là món ăn sang trọng, mang đến trải nghiệm ẩm thực đầy phong phú với hương vị tươi ngon của cá hồi kết hợp với các loại hải sản như tôm, mực và sò điệp. Món ăn được chế biến một cách tinh tế, thường được nướng hoặc hấp để giữ nguyên độ tươi ngon và dinh dưỡng. Hương vị đặc trưng của cá hồi hòa quyện cùng các loại gia vị nhẹ nhàng như chanh, tỏi và rau thơm tạo nên một bữa ăn không chỉ hấp dẫn mà còn rất bổ dưỡng. Cá hồi hải sản là lựa chọn hoàn hảo cho những ai yêu thích ẩm thực hải sản và muốn thưởng thức những hương vị mới lạ.",
        "image_link": "https://cdn.pixabay.com/photo/2014/11/05/15/57/salmon-518032_1280.jpg"
    },    
    {
        "id": 7655,
        "name": "Pizza",
        "price": 300000,
        "type": "Chay",
        "description": "Pizza là món ăn nổi tiếng toàn cầu, đặc biệt được yêu thích với lớp vỏ bánh giòn rụm, phủ một lớp sốt cà chua thơm ngon và phô mai chảy mềm. Món ăn này được trang trí với các loại rau củ tươi ngon như ớt chuông, nấm, hành tây, và ô liu, mang đến hương vị phong phú và màu sắc hấp dẫn. Pizza không chỉ là món ăn tuyệt vời cho những buổi tiệc tùng mà còn là lựa chọn hoàn hảo cho bữa tối gia đình. Mỗi miếng pizza đều chứa đựng sự kết hợp hoàn hảo giữa độ giòn và hương vị thơm ngon, khiến cho bất kỳ ai cũng phải say mê.",
        "image_link": "https://cdn.pixabay.com/photo/2015/02/13/11/04/pizza-634967_1280.jpg"
    },    
    {
        "id": 2936,
        "name": "Mì ống sốt lá húng",
        "price": 350000,
        "type": "Chay",
        "description": "Mì ống sốt lá húng là món ăn hấp dẫn với sự kết hợp hoàn hảo giữa mì ống mềm mượt và sốt lá húng thơm lừng. Sốt được làm từ lá húng tươi, olive oil, và gia vị tự nhiên, tạo nên hương vị tươi mát và độc đáo. Món ăn này thường được trang trí với hạt dẻ cười rang và phô mai Parmesan bào mỏng, mang đến trải nghiệm ẩm thực đầy tinh tế. Mì ống sốt lá húng không chỉ ngon miệng mà còn rất bổ dưỡng, thích hợp cho những ai yêu thích ẩm thực chay và muốn thưởng thức hương vị tươi mới.",
        "image_link": "https://cdn.pixabay.com/photo/2016/11/23/18/31/pasta-1854245_1280.jpg"
    },    
    {
        "id": 5849,
        "name": "Cá hồi",
        "price": 700000,
        "type": "Mặn",
        "description": "Cá hồi là nguồn dinh dưỡng dồi dào, được biết đến với hương vị thơm ngon và giàu omega-3. Món cá hồi này được chế biến với gia vị nhẹ nhàng, nướng hoặc áp chảo, giữ nguyên độ tươi ngon và mềm mại. Thưởng thức cá hồi cùng với một chút chanh tươi và rau xanh, bạn sẽ cảm nhận được sự hòa quyện tuyệt vời giữa hương vị và dinh dưỡng.",
        "image_link": "https://cdn.pixabay.com/photo/2010/12/13/10/25/canape-2802_1280.jpg"
    },    
    {
        "id": 7084,
        "name": "Bánh mì phô mai",
        "price": 50000,
        "type": "Tăng cân",
        "description": "Bánh mì phô mai là sự kết hợp hoàn hảo giữa lớp bánh mì nóng giòn và phô mai tan chảy. Món ăn này thường được ăn kèm với các loại rau củ tươi ngon, mang đến hương vị hấp dẫn và bổ dưỡng. Đặc biệt, bánh mì phô mai là lựa chọn tuyệt vời cho những ai yêu thích đồ ăn nhanh nhưng vẫn muốn tận hưởng sự tinh tế trong từng miếng ăn.",
        "image_link": "https://cdn.pixabay.com/photo/2020/06/03/08/53/mozzarella-5254110_1280.jpg"
    },    
    {
        "id": 7750,
        "name": "Thịt kho tàu",
        "price": 800000,
        "type": "Tăng cân",
        "description": "Thịt kho tàu là món ăn truyền thống, với thịt heo được kho nhừ trong nước dừa tươi, mang đến hương vị đậm đà và ngọt ngào. Món ăn này thường được ăn kèm với cơm trắng và dưa leo, tạo nên một bữa ăn hoàn hảo. Hương vị của thịt kho tàu không chỉ ngon mà còn gợi nhớ về những bữa cơm gia đình ấm áp.",
        "image_link": "https://cdn.pixabay.com/photo/2024/10/06/19/35/asian-cuisine-9101015_1280.jpg"
    },    
    {
        "id": 8778,
        "name": "Mì ramen",
        "price": 300000,
        "type": "Giảm cân",
        "description": "Mì ramen là món ăn đặc trưng của Nhật Bản, với sợi mì mềm mượt và nước dùng thơm ngon được nấu từ xương và rau củ. Món ăn này thường được trang trí với trứng lòng đào, hành lá và thịt heo xá xíu, mang đến hương vị hấp dẫn. Ramen không chỉ ngon mà còn là sự lựa chọn hoàn hảo cho những ai muốn thưởng thức món ăn nhẹ nhàng và dinh dưỡng.",
        "image_link": "https://cdn.pixabay.com/photo/2024/06/18/07/13/ramen-8837174_1280.png"
    },    
    {
        "id": 4979,
        "name": "Tôm hấp",
        "price": 70000,
        "type": "Mặn",
        "description": "Tôm hấp là món ăn tươi ngon, giữ nguyên hương vị tự nhiên và độ ngọt tự nhiên của tôm. Được hấp trong các gia vị như gừng và sả, món ăn mang lại hương thơm quyến rũ, thường được ăn kèm với muối tiêu chanh. Tôm hấp không chỉ ngon mà còn giàu chất dinh dưỡng.",
        "image_link": "https://cdn.pixabay.com/photo/2015/09/26/15/33/prawns-959219_1280.jpg"
    },    
    {
        "id": 8979,
        "name": "Cá viên chiên",
        "price": 450000,
        "type": "Mặn",
        "description": "Cá viên chiên giòn là món ăn ngon miệng, được làm từ cá tươi ngon và các gia vị thơm ngon. Những viên cá chiên vàng giòn bên ngoài, mềm mịn bên trong, thường được thưởng thức kèm với tương ớt hoặc sốt mayonnaise. Đây là lựa chọn tuyệt vời cho bữa ăn nhẹ hoặc món ăn vặt.",
        "image_link": "https://cdn.pixabay.com/photo/2020/03/28/14/52/egg-4977357_1280.jpg"
    },    
    {
        "id": 5869,
        "name": "Salad",
        "price": 800000,
        "type": "Chay",
        "description": "Salad là món ăn nhẹ đầy dinh dưỡng, kết hợp nhiều loại rau củ tươi sống và trái cây. Thêm vào đó, nước sốt chua ngọt hoặc dầu ô liu giúp tăng thêm hương vị. Món ăn này không chỉ tốt cho sức khỏe mà còn giúp cân bằng chế độ ăn uống của bạn.",
        "image_link": "https://cdn.pixabay.com/photo/2020/03/28/14/53/salad-4977372_1280.jpg"
    },    
    {
        "id": 9370,
        "name": "Súp bí ngô",
        "price": 300000,
        "type": "Chay",
        "description": "Súp bí ngô là món ăn thơm ngon và bổ dưỡng, được chế biến từ bí ngô tươi, sữa tươi và các gia vị nhẹ nhàng. Với hương vị ngọt ngào và mịn màng, súp bí ngô là lựa chọn lý tưởng cho bữa ăn nhẹ hoặc khai vị, mang lại cảm giác ấm áp trong mùa lạnh.",
        "image_link": "https://cdn.pixabay.com/photo/2018/08/31/19/13/pumpkin-soup-3645375_1280.jpg"
    },    
    {
        "id": 2062,
        "name": "Bánh canh",
        "price": 600000,
        "type": "Mặn",
        "description": "Bánh canh là món ăn đặc sản miền Trung, với sợi bánh canh mềm mịn được nấu trong nước dùng hương vị đậm đà. Món ăn thường đi kèm với các loại hải sản tươi sống hoặc thịt heo, mang lại trải nghiệm ẩm thực phong phú và hấp dẫn.",
        "image_link": "https://cdn.pixabay.com/photo/2020/03/07/02/28/bread-soup-4908531_1280.jpg"
    },    
    {
        "id": 4007,
        "name": "Bánh xèo",
        "price": 500000,
        "type": "Mặn",
        "description": "Bánh xèo là món bánh nổi tiếng, có lớp vỏ giòn tan, nhân tôm, thịt và giá đỗ. Thưởng thức bánh xèo kèm với rau sống và nước mắm chua ngọt, mang đến sự kết hợp hoàn hảo giữa vị giòn, vị ngọt và vị tươi mát.",
        "image_link": "https://cdn.pixabay.com/photo/2020/09/26/02/08/banh-xeo-5602960_1280.jpg"
    },    
    {
        "id": 8826,
        "name": "Bánh cuốn chả giò",
        "price": 900000,
        "type": "Tăng cân",
        "description": "Bánh cuốn chả giò là sự kết hợp giữa bánh cuốn mềm mịn và chả giò giòn tan. Món ăn này được thưởng thức cùng với nước chấm đặc biệt, mang đến hương vị thơm ngon và ấn tượng. Đây là món ăn lý tưởng cho những ai yêu thích ẩm thực truyền thống Việt Nam.",
        "image_link": "https://cdn.pixabay.com/photo/2023/07/18/19/19/spring-rolls-8135469_1280.jpg"
    },    
    {
        "id": 8535,
        "name": "Bánh dâu",
        "price": 700000,
        "type": "Chay",
        "description": "Bánh dâu là món ăn ngọt ngào, với lớp vỏ mềm mại và nhân dâu tươi ngon. Món bánh này thường được thưởng thức như một món tráng miệng, mang đến cảm giác mát lạnh và dễ chịu, hoàn hảo cho các buổi tiệc hoặc bữa ăn nhẹ.",
        "image_link": "https://cdn.pixabay.com/photo/2018/05/01/18/21/eclair-3366430_1280.jpg"
    },    
    {
        "id": 4740,
        "name": "Nui",
        "price": 750000,
        "type": "Mặn",
        "description": "Nui là món ăn đơn giản nhưng ngon miệng, với sợi nui mềm được chế biến với các loại thịt và rau củ tươi ngon. Món ăn thường được nêm nếm vừa miệng, mang đến trải nghiệm ẩm thực phong phú và dinh dưỡng.",
        "image_link": "https://cdn.pixabay.com/photo/2023/03/13/11/13/scallions-7849575_1280.jpg"
    },    
    {
        "id": 8101,
        "name": "Bánh quy",
        "price": 500000,
        "type": "Giảm cân",
        "description": "Bánh quy là món ăn nhẹ giòn tan, thường được làm từ bột mì và các nguyên liệu tự nhiên. Chúng có thể được thưởng thức như một món ăn vặt hoặc dùng kèm với trà và cà phê. Bánh quy là lựa chọn hoàn hảo cho những ai yêu thích sự nhẹ nhàng và dễ tiêu hóa.",
        "image_link": "https://cdn.pixabay.com/photo/2015/11/19/20/17/cookies-1051884_1280.jpg"
    }    
]